tutorials/asymmetricalPipe/openHFDIBRANS/0.org/kQ
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kQ;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        zeroGradient;
    }

    wall
    {
        type        zeroGradient;
    }

    wallInsideLambda
    {
        type        zeroGradient;
    }

    frontAndBack
    {
        type        empty;
    }
}

// ************************************************************************* //
